In [25]:
# Instalamos el driver de cassandra
# sudo pip install cassandra-driver
# sudo pip uninstall cassandra-driver

In [39]:
# Vamos a importar
from cassandra.cluster import Cluster
# Vamos a conectarno a la base de datos:

## Iniciareos el contenedor de Docker con la iagen de cassandra:
'''
docker pull cassandra

Cluster: Para esta práctica solo usaremos un nodo
docker run --name prueba -p 9042:9042 -e CASSANDRA_CLUSTER_NAME=MyCluster -e CASSANDRA_ENDPOINT_SNITCH=GossipingPropertyFileSnitch -e CASSANDRA_DC=datacenter1 -d cassandra

docker run --name prac2 -p 9042:9042 -e CASSANDRA_CLUSTER_NAME=MyCluster -e CASSANDRA_ENDPOINT_SNITCH=GossipingPropertyFileSnitch -e CASSANDRA_DC=datacenter1 -d imagen-cassandra

docker run --name prac2 -p 192.168.99.100:9042 -e CASSANDRA_CLUSTER_NAME=MyCluster -e CASSANDRA_ENDPOINT_SNITCH=GossipingPropertyFileSnitch -e CASSANDRA_DC=datacenter1 -d imagen-cassandra

# Propuesta de Alejandro

sudo docker run --name practica2 -p 127.0.0.1:9042:9042 -p 127.0.0.1:9160:9160 -d imagen-cassandra

Conexión:
docker exec -it prac2 bash

Información del Nodo:
nodetool status

'''
# Indicación de nuestra imagen

cluster = Cluster(contact_points=['0.0.0.0'], port=9042)

# Generar la conexión
session = cluster.connect()

In [ ]:
'''
Creación del KEYSPACE:  que vamos a llamar peliculas
y le vamos a poner una estrategia de replicación de tipo 
SimpleStrategy y con un factor de replicación igual a 1.
'''
session.execute("""CREATE KEYSPACE base_datos WITH replication = {'class' : 'SimpleStrategy', 'replication_factor':1};""")

### Creación de la Tablas.

In [41]:
# Seleccionamos el KEYSPACE
session.set_keyspace('base_datos')

In [ ]:
# Creamos la tabla
session.execute("""
                CREATE TABLE resenas (
                    membresia int,
                    id_libro int,
                    titulo text,
                    autor text, 
                    categoria text,
                    calificacion float,
                    nombre text STATIC,
                    a_p text STATIC,
                    a_m text STATIC,
                    pais text STATIC,
                    fechnac date STATIC,
                    PRIMARY KEY (membresia, id_libro));
                """)

In [ ]:
# Ingresemos los datos:

session.execute("""
                INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61682,5,'100 años de soledad','Gabriel García Marquez','Realismo Mágico',5.00,'Daniel','Fragoso','Alvarado','Mexico','2000-08-16');
                """)

In [ ]:
'''
Ingresamos los datos:
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61682,5,'100 años de soledad','Gabriel García Marquez','Realismo Mágico',5.00,'Daniel','Fragoso','Alvarado','Mexico','2000-08-16');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61683,6,'La casa de Bernarda Alba','Federico García Lorca','Autobiografía',5.00,'Enrique','Gómez','Martinez','Mexico','1999-07-10');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61684,7,'Una educación','Tara Westover','Ciencia Ficcion',5.00,'Hugo','Rangel','Ramirez','Mexico','2000-04-06');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61683,8,'Do androids dream of electric sheep?','Philip K. Dick','Novela',4.00,'Enrique','Gómez','Martinez','Mexico','1999-07-10');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61684,9,'Solo quedó nuestra historia','Adam Silvera','Cuento',3.00,'Hugo','Rangel','Ramirez','Mexico','2000-04-06');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61684,10,'El Tapiz Amarillo','Charlotte Perkins Gilman','Novela',4.00,'Hugo','Gómez','Martinez','Mexico','2000-04-06');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61683,11,'Lazarillo de Tormes','NULL','Novela',1.00,'Enrique','Gómez','Martinez','Mexico','1999-07-10');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61682,12,'La cancion de Aquiles','Madeline Miller','Novela',5.00,'Daniel','Fragoso','Alvarado','Mexico','2000-08-16');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61683,13,'Doña Perfecta','Benito Pérez Galdós','Cuento',4.00,'Enrique','Gómez','Martinez','Mexico','1999-07-10');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61684,14,'La metamorfosis','Franz Kafka','Cuento',4.00,'Hugo','Rangel','Ramirez','Mexico','2000-04-06');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61683,15,'Erecciones, eyaculaciones, exhibiciones','Charles Bukowski','Ciencia Ficcion',4.00,'Enrique','Gómez','Martinez','Mexico','1999-07-10');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61683,16,'Un mundo feliz','Aldous Huxley','Novela',5.00,'Enrique','Gómez','Martinez','Mexico','1999-07-10');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61683,17,'Ender''s Game','Orson Scott Card','Novela',3.00,'Enrique','Gómez','Martinez','Mexico','1999-07-10');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61682,18,'Pedro Paramo','Juan Rulfo','Novela',3.00,'Daniel','Fragoso','Alvarado','Mexico','2000-08-16');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61683,19,'Travesuras de la niña mala','Mario Vargas Llosa','Novela',5.00,'Enrique','Gómez','Martinez','Mexico','1999-07-10');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61684,12,'La cancion de Aquiles','Madeline Miller','Novela',4.00,'Hugo','Rangel','Ramirez','Mexico','2000-04-06');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61683,20,'El Periquillo de Sarniento','José Joaquín Fernández de Lizardi','Novela',2.00,'Enrique','Gómez','Martinez','Mexico','1999-07-10');

INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61685,21,'Exhalation','Ted Chiang','Cuento',4,'Fernando','Santa Rita','Vizuet','Mexico','1998-06-21');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61686,22,'1Q84','Haruki Murakami','Novela',5,'Guillermo','Andrés','Urbano','Mexico','1998-11-12');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61686,23,'El coronel no tiene quien le escriba','Gabriel García Márquez','Novela',4,'Guillermo','Andrés','Urbano','Mexico','1998-11-12');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61686,24,'El señor de las moscas','William Golding','Novela',4,'Guillermo','Andrés','Urbano','Mexico','1998-11-12');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61686,25,'La maquina del tiempo','H. G. Wells','Ciencia Ficcion',4,'Guillermo','Andrés','Urbano','Mexico','1998-11-12');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61686,26,'La guerra de los mundos','H. G. Wells','Ciencia Ficcion',4,'Guillermo','Andrés','Urbano','Mexico','1998-11-12');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61687,27,'Bajo la rueda','Hermann Hesse','Novela',4,'Fernando','Avitúa','Varela','Mexico','1989-05-14');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61687,28,'Siddharta','Hermann Hesse','Novela',5,'Fernando','Avitúa','Varela','Mexico','1989-05-14');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61687,29,'El Lobo Estepario','Hermann Hesse','Novela',5,'Fernando','Avitúa','Varela','Mexico','1989-05-14');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61687,30,'One Shot','Lee Child','Suspenso',4,'Fernando','Avitúa','Varela','Mexico','1989-05-14');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61687,20,'El Periquillo de Sarniento','José Joaquín Fernández de Lizardi','Novela',4,'Fernando','Avitúa','Varela','Mexico','1989-05-14');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61688,31,'Harry Potter','J. K. Rowling','Fantasia',5,'Yeudiel','Lara','Moreno','Mexico','2000-04-06');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61689,30,'One Shot','Lee Child','Suspenso',5,'Eduardo','Garduño','Martinez','Mexico','1999-12-04');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61685,33,'On the road','Jack Kerouac','Novela',5,'Fernando','Santa Rita','Vizuet','Mexico','1998-06-21');
INSERT INTO resenas(membresia,id_libro,titulo,autor,categoria,calificacion,nombre,a_p,a_m,pais,fechnac) VALUES (61690,34,'The Pillars of the Earth','Ken Follett','Novela',4,'Edgar','Callejas','Hernandez','Mexico','2001-08-06');
'''

Por la naturaleza de Cassandra vamos a pensar primero en la consulta antes de generar la tabla:

1. La categoría preferida de un cliente dado.

In [49]:
import pandas as pd

In [43]:
# Creamos la tabla
session.execute("""
                CREATE TABLE con1 (
                    membresia int,
                    id_libro int,
                    titulo text,
                    autor text, 
                    categoria text,
                    calificacion float,
                    nombre text STATIC,
                    a_p text STATIC,
                    a_m text STATIC,
                    pais text STATIC,
                    fechnac date STATIC,
                    PRIMARY KEY (membresia, categoria, id_libro));
                """)

In [53]:
'''
Kike = 61683
'''

kike = session.execute("""
                SELECT categoria, AVG(calificacion) AS cal FROM con1 WHERE membresia = 61683 GROUP BY categoria;
                """)

df = pd.DataFrame(list(kike))

# Obtengamos aquellas categorias que mejor evaluadas han sido:

df.max()

categoria    Novela
cal             5.0
dtype: object

In [54]:
'''
Guille = 61686
'''

guille = session.execute("""
                SELECT categoria, AVG(calificacion) AS cal FROM con1 WHERE membresia = 61686 GROUP BY categoria;
                """)

df = pd.DataFrame(list(guille))

# Obtengamos aquellas categorias que mejor evaluadas han sido:

df.max()

categoria      Novela
cal          4.333333
dtype: object

In [ ]:
'''
Podemos consultar las tablas creadas con:
DESCRIBE tables

Vamos a activar la vista materialziada

'''

# Creamos la vista materializada
session.execute("""
                CREATE MATERIALIZED VIEW top AS SELECT
                membresia, id_libro, categoria, calificacion, titulo, autor
                FROM resenas WHERE membresia IS NOT NULL AND id_libro IS NOT NULL AND
                categoria IS NOT NULL AND calificacion IS NOT NULL AND titulo IS NOT NULL AND 
                autor IS NOT NULL PRIMARY KEY (categoria, id_libro, membresia);
                """)

2. Obtener los clientes que más disfrutaron un libro dado.

In [84]:
# Creamos la tabla
session.execute("""
                CREATE TABLE con2 (
                    membresia int,
                    id_libro int,
                    titulo text,
                    autor text, 
                    categoria text,
                    calificacion float,
                    nombre text,
                    a_p text,
                    a_m text,
                    pais text STATIC,
                    fechnac date,
                    PRIMARY KEY (id_libro, membresia));
                """)

In [97]:
'''
La cancion de Aquiles : 12
'''

aquiles_song = session.execute("""
                SELECT nombre, a_p, a_m, calificacion FROM con2 WHERE id_libro = 12;
                """)

df = pd.DataFrame(list(aquiles_song))

# Obtengamos el usuario(s)
df[df.calificacion == df.calificacion.max()]

#df

   nombre      a_p       a_m  calificacion
0  Daniel  Fragoso  Alvarado           5.0

In [100]:
'''
El Periquillo de Sarniento : 20
'''

p_sarmiento = session.execute("""
                SELECT nombre, a_p, a_m, calificacion FROM con2 WHERE id_libro = 20;
                """)

df = pd.DataFrame(list(p_sarmiento))

# Obtengamos el usuario(s)
df[df.calificacion == df.calificacion.max()]

     nombre     a_p     a_m  calificacion
1  Fernando  Avitúa  Varela           4.0

3. Los mejores libros de una categoría dada.

In [104]:
# Creamos la tabla
session.execute("""
                CREATE TABLE con3 (
                    membresia int,
                    id_libro int,
                    titulo text,
                    autor text, 
                    categoria text,
                    calificacion float,
                    nombre text,
                    a_p text,
                    a_m text,
                    pais text STATIC,
                    fechnac date,
                    PRIMARY KEY (categoria, id_libro, membresia));
                """)

In [107]:
'''
Novela
'''

novela = session.execute("""
                SELECT id_libro, titulo,  AVG(calificacion) AS cal FROM con3 WHERE categoria = 'Novela' GROUP BY id_libro;
                """)

df = pd.DataFrame(list(novela))

# Obtengamos el los mejores
df[df.cal == df.cal.max()]

    id_libro                      titulo  cal
4         16              Un mundo feliz  5.0
7         19  Travesuras de la niña mala  5.0
9         22                        1Q84  5.0
13        28                   Siddharta  5.0
14        29           El Lobo Estepario  5.0
15        33                 On the road  5.0

In [108]:
'''
Ciencia Ficcion
'''

novela = session.execute("""
                SELECT id_libro, titulo,  AVG(calificacion) AS cal FROM con3 WHERE categoria = 'Ciencia Ficcion' GROUP BY id_libro;
                """)

df = pd.DataFrame(list(novela))

# Obtengamos el los mejores
df[df.cal == df.cal.max()]

   id_libro         titulo  cal
0         7  Una educación  5.0

In [28]:
cluster.shutdown()